app/controllers/tweet_codes_controller.rb

  def index
    @tweet_items = TweetCode.all
---
SELECT `tweet_codes`.* FROM `tweet_codes`

  def create
    code_image = base64_conversion(params[:params][:code_image])
    sorted_tweet_data = TweetCode.sort_tweet_item(tweet_params, params[:params][:code_image])
    # code_image.headers = ''
    sorted_tweet_data[:code_image] = code_image
    @tweet_item = current_user.tweet_codes.create(sorted_tweet_data)
---
INSERT INTO `tweet_codes` (`hat_name`, `hat_image`, `hat_type`, `hat_class`, `tops_name`, `tops_image`, `tops_type`, `tops_class`, `pants_name`, `pants_image`, `pants_type`, `pants_class`, `shoes_name`, `shoes_image`, `shoes_type`, `shoes_class`, `user_id`, `created_at`, `updated_at`) VALUES ('ユニクロ帽子', '/uploads/wear_item/image/1/hat.png', 'hat', 'cap', 'ユニクロ上着', '/uploads/wear_item/image/15/jacket-outerwear.png', 'jacket-outerwear', 'tailored-jacket', 'ユニクロパンツ', '/uploads/wear_item/image/25/pants.png', 'pants', 'denim-pants', 'ユニクロ靴', '/uploads/wear_item/image/31/pants.png', 'shoes', 'sneakers', 3, '2018-03-02 09:55:04', '2018-03-02 09:55:04')