app/controllers/users_controller.rb

  def update


    binding.pry
    user_image = params[:image]
    user_nickname = params[:nickname]
    contents = {}
    if user_image != nil && user_nickname != nil
      contents[:image] = user_image
      contents[:nickname] = user_nickname
    end

    current_user.update(image: contents[:image], nickname: contents[:nickname])
---
UPDATE `users` SET `nickname` = '文字を入力してね', `image` = '#<ActionDispatch::Http::UploadedFile:0x007f8ef3799eb8>', `updated_at` = '2018-03-04 06:37:52' WHERE `users`.`id` = 1