app/controllers/want_closets_controller.rb

  def index
    @WantClosetItem = current_user.want_closets.all
---
SELECT `want_closets`.* FROM `want_closets` WHERE `want_closets`.`user_id` = 3

  def create
    @WantClosetItem = current_user.want_closets.create(want_item_params)
---
INSERT INTO `want_closets` (`maker`, `title`, `itemtype`, `itemClass`, `image`, `user_id`, `created_at`, `updated_at`) VALUES ('ユニクロ', 'ユニクロ上着', 'jacket-outerwear', 'tailored-jacket', '/uploads/wear_item/image/15/jacket-outerwear.png', 3, '2018-03-02 07:15:39', '2018-03-02 07:15:39')