app/controllers/wear_items_controller.rb

  def index
    # @WearItem = WearItem.search(title: params[:search]).result[0..9]
    @WearItem = WearItem.search(title: params[:search]).result
---
SELECT `wear_items`.* FROM `wear_items` WHERE `wear_items`.`title` = '上着'